ANPdata:
- creation_date = "2021/07/28"
- maturity = "production"
- updated_date = "2021/07/28"

ANPrule: 
- author: ["Elastic"]

- description : |
    """
    Detects when multiple hosts are using the same agent ID. This could occur in the event of an agent
    being taken over and used to inject illegitimate documents into an instance as an attempt to spoof events in order to
    masquerade actual activity to evade detection."""

- false_positives :  ["This is meant to run only on datasources using agents v7.14+ since versions prior to that will be missing the necessary field, resulting in false positives."]

- language : "eql"

- license : "Elastic License v2"

- risk_score : 73

- rule_id : "493834ca-f861-414c-8602-150d5505b777"

- severity : "high"

- tags :  ["Elastic", "Threat Detection", "Defense Evasion"]

- threat: [

    
    [framework : "MITRE ATT&CK",
      tactic: [
        id : "TA0002",      name : "Execution",      reference : "https://attack.mitre.org/tactics/TA0002/"]],

    [framework : "MITRE ATT&CK",
    
    technique: [
      id : "T1566",
      name : "Phishing",
      reference : "https://attack.mitre.org/techniques/T1566/",
      subtechnique: [

        [id : "T1566.001",        name : "Spearphishing Attachment",        reference : "https://attack.mitre.org/techniques/T1566/001/"],     
        [id : "T1566.002",        name : "Spearphishing Link",        reference : "https://attack.mitre.org/techniques/T1566/002/"]
      ]
    ],
    
    tactic: [
      id : "TA0001",
      name : "Initial Access",
      reference : "https://attack.mitre.org/tactics/TA0001/"]
]]


name: "EQL_rule"

index: winlogalias

type: any

eql: 
  "query": "any where event.code == \"761\""


###packetbeat>> dns.question.name = jimdosite.com
alert:
- "slack"

slack:
slack_webhook_url: "https://hooks.slack.com/services/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"

